SBIR_CFD_Phase_I/Configure/VOF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;
startFrom			startTime;
startTime			0;
stopAt				endTime;
endTime				%endTime%;
deltaT           	1e-6;
writeControl    adjustableRunTime;
writeInterval		0.1;//%writeInterval%;	
purgeWrite			10;//%purgeWrite%;
writeFormat     ascii;
writePrecision  9;
writeCompression uncompressed;
timeFormat      general;
timePrecision   9;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           50;
maxAlphaCo      50;
maxDeltaT       0.005;

libs (
"libOpenFOAM.so"
"libsimpleSwakFunctionObjects.so"
"libswakFunctionObjects.so"
"libgroovyBC.so"
);

functions
	{
	#includeFunc 	residuals;
	#includeFunc	wallShearStress;
	#includeFunc	writeCellCentres;

	}
// ************************************************************************* 
