SBIR_CFD_Phase_I/Configure/VOF/system/snappyHexMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// REFERENCE MATERIALS:
// https://openfoamwiki.net/images/f/f0/Final-AndrewJacksonSlidesOFW7.pdf
//

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       %layerTF%;

geometry
{
    RiverBed
    {
        type triSurfaceMesh;
        file "Bathymetry.stl";
    }
    BridgeStructure
    {
        type triSurfaceMesh;
        file "BridgeStructure.stl";
    }
};

castellatedMeshControls
{

    maxLocalCells 10000000;
    maxGlobalCells 20000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.50; 
    nCellsBetweenLevels 1;

    features
    (
		{ file "Bathymetry.eMesh"; level %BathymetryL%; }
		{ file "BridgeStructure.eMesh"; level %BridgeStructureL%; }
	);

    resolveFeatureAngle 1;
    refinementSurfaces
    {
        BridgeStructure { level %BridgeStructure%; gapLevelIncrement 1;}
        RiverBed { level %RiverBed%; }
    }

    refinementRegions
    {
        BridgeStructure {  mode distance; levels %BridgeStructureRegion%; gapLevelIncrement 1; }
    }

    locationInMesh %Point_in_Mesh%;
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 6.0;
    nSolveIter 15;
    nRelaxIter 10;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    layers
    {
        RiverBed { nSurfaceLayers %nLayer%; }
        //BridgeStructure { nSurfaceLayers 1; }
    }

	// finalLayerThickness and minThickness in meters when false
    relativeSizes false;
    firstLayerThickness %firstLayerThickness%;
    minThickness 0.0001;
    expansionRatio 1.5;
    nGrow 0;

	// create surface layers at sharp corners (was 45)
    featureAngle 179;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"
    nSmoothScale 6;
    errorReduction 0.75;
}

writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);

mergeTolerance 1E-7;

// ************************************************************************* //
