SBIR_CFD_Phase_I/Configure/VOF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform %InletVelocity%;

boundaryField
{
    Inlet_water
    {
        type 			fixedValue;
        value           $internalField; 
    }
    Inlet_air
    {
        type fixedValue;
        value           uniform (0 0 0);
    }
    Outlet_air
    {
        type            zeroGradient;
    }
    Outlet_water
    {
        type            zeroGradient;
    }
    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Ceil
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //

