SBIR_CFD_Phase_I/Configure/VOF/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform %epsilon%;

boundaryField
{
    Inlet_water
    {
        type 			fixedValue;
        value           $internalField; 
    }
    Inlet_air
    {
        type 			fixedValue;
        value           $internalField; 
    }
    Outlet_water
    {
        type            zeroGradient;
    }
    Outlet_air
    {
        type            zeroGradient;
    }
    ".*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    Ceil
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
