SBIR_CFD_Phase_I/Configure/VOF/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Include defaults parameters from master dictionary
//#includeEtc "caseDicts/meshQualityDict" //of5
#includeEtc "caseDicts/mesh/generation/meshQualityDict" //of6
//- minFaceWeight (0 -> 0.5)
minFaceWeight 0.02;

// ************************************************************************* //
