SBIR_CFD_Phase_I/Configure/VOF/system/surfaceFeaturesDict1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ( "BridgeStructure.stl" "Bathymetry.stl" );

// Identify a feature when angle between faces < includedAngle
includedAngle		175;
//geometricTestOnly	yes;
//intersectionMethod	self;
subsetFeatures
{
	nonManifoldEdges yes;
	openEdges	yes;
}
// ************************************************************************* //
